{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_3","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,17,1],"dtype":"float32","sparse":false,"name":"lstm_2_input"}},{"class_name":"LSTM","config":{"name":"lstm_2","trainable":true,"batch_input_shape":[null,17,1],"dtype":"float32","units":128,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},{"class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_12","trainable":true}},{"class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_9","trainable":true}},{"class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_13","trainable":true}},{"class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_10","trainable":true}},{"class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_14","trainable":true}},{"class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_11","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_15","trainable":true}}]},"keras_version":"tfjs-layers 4.10.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"lstm_2/kernel","shape":[1,512],"dtype":"float32"},{"name":"lstm_2/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"lstm_2/bias","shape":[512],"dtype":"float32"},{"name":"dense_12/kernel","shape":[128,128],"dtype":"float32"},{"name":"dense_12/bias","shape":[128],"dtype":"float32"},{"name":"dense_13/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_13/bias","shape":[64],"dtype":"float32"},{"name":"dense_14/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_14/bias","shape":[32],"dtype":"float32"},{"name":"dense_15/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_15/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.10.0","convertedBy":null}